new-residentes-api/app/controllers/api/v1/residents_controller.rb

    def index
        @residents = Resident.order(:created_at)
---
SELECT "residents".* FROM "residents" ORDER BY "residents"."created_at" ASC

    def create
        @resident = Resident.new(resident_params)

        if @resident.save
---
INSERT INTO "residents" ("name", "whatsapp", "email", "registration_id", "initial_date", "final_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"