new-residentes-api/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def token_authenticate
        @token = request.headers["Authenticate"]
        @user = User.find(decode_token(@token)["user_id"])

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "authentication_token") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def create
      user = User.create(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 10]]
---
    def destroy
        @user = User.find(params[:id])

        if @user.present?
            render json: @user
            @user.destroy