new-residentes-api/app/controllers/users/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "1212@1212"], ["LIMIT", 1]]
---
    def create
      user = User.find_by_email(sign_in_params[:email])